Autodesk.Revit.DB.FormaRoadTriangulationResult.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FormaRoadTriangulationResult.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.UV},System.Collections.Generic.IList{System.Int32})
Construct from triangulation outputs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.FormaRoadTriangulationResult
Output of FormaRoad::triangulatePlanarRegion. Holds the (possibly Steiner-
extended) 2D vertex pool plus a flat triangle index array (3 sequential
indices per triangle, matching the FormaTriangleMesh triangles convention).
Since:
2027